
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
* Delete
  * azurerm_key_vault_secret.POSTGRES_DATABASE-v16


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "commondata-api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-v16" {
      - id                      = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-DATABASE-v16/e77281e0f5e64928928f949e886f61c6" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - name                    = "commondata-api-POSTGRES-DATABASE-v16" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-DATABASE-v16/versions/e77281e0f5e64928928f949e886f61c6" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/secrets/commondata-api-POSTGRES-DATABASE-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e77281e0f5e64928928f949e886f61c6" -> null
      - versionless_id          = "https://rd-aat.vault.azure.net/secrets/commondata-api-POSTGRES-DATABASE-v16" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":496,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->